In [8]:
import numpy as np
import pandas as pd

In [10]:
weatherForecast=pd.DataFrame({"London":[13,12,14],"Paris":[17,np.nan,15],"Madrid":[20,22,np.nan]})

In [12]:
weatherForecast

   London  Paris  Madrid
0      13   17.0    20.0
1      12    NaN    22.0
2      14   15.0     NaN

In [13]:
weatherForecast.dropna()

   London  Paris  Madrid
0      13   17.0    20.0

In [14]:
weatherForecast.dropna(axis=1)

   London
0      13
1      12
2      14

In [15]:
newWeatherForecast=pd.DataFrame({"London":[13,12,14],"Paris":[17,np.nan,15],"Madrid":[20,22,np.nan],"Rome":[21,np.nan,np.nan]})

In [16]:
newWeatherForecast

   London  Paris  Madrid  Rome
0      13   17.0    20.0  21.0
1      12    NaN    22.0   NaN
2      14   15.0     NaN   NaN

In [19]:
newWeatherForecast.dropna(axis=1,thresh=2) ## if there are +2 nan data drop it

   London  Paris  Madrid
0      13   17.0    20.0
1      12    NaN    22.0
2      14   15.0     NaN

In [20]:
newWeatherForecast

   London  Paris  Madrid  Rome
0      13   17.0    20.0  21.0
1      12    NaN    22.0   NaN
2      14   15.0     NaN   NaN

In [21]:
newWeatherForecast.fillna(20) # fill  all nan data as 20

   London  Paris  Madrid  Rome
0      13   17.0    20.0  21.0
1      12   20.0    22.0  20.0
2      14   15.0    20.0  20.0

## Groupby

In [51]:
salaryData= {"Department":["Software","Software","Marketing","Marketing","Sale","Sale"],
            "Employees":["Blair","Charles","Nathaniel","Carter","Louie","Dorota"],
             "Salary":[1000,10002,3423,43654,45645,23223],
             
            }

In [53]:
salaryDataFrame=pd.DataFrame(salaryData)

In [55]:
salaryDataFrame

  Department  Employees  Salary
0   Software      Blair    1000
1   Software    Charles   10002
2  Marketing  Nathaniel    3423
3  Marketing     Carter   43654
4       Sale      Louie   45645
5       Sale     Dorota   23223

In [60]:
groupObject=salaryDataFrame.groupby("Department")

In [66]:
groupObject.count()

            Employees  Salary
Department
Marketing           2       2
Sale                2       2
Software            2       2

In [74]:
groupObject.mean(numeric_only=True)

             Salary
Department
Marketing   23538.5
Sale        34434.0
Software     5501.0

In [76]:
groupObject.max()

            Employees  Salary
Department
Marketing   Nathaniel   43654
Sale            Louie   45645
Software      Charles   10002

In [78]:
groupObject.min()

           Employees  Salary
Department
Marketing     Carter    3423
Sale          Dorota   23223
Software       Blair    1000

In [82]:
groupObject.describe()

           Salary                                                     \
            count     mean           std      min       25%      50%
Department
Marketing     2.0  23538.5  28447.612914   3423.0  13480.75  23538.5
Sale          2.0  34434.0  15854.748248  23223.0  28828.50  34434.0
Software      2.0   5501.0   6365.375244   1000.0   3250.50   5501.0


                 75%      max
Department
Marketing   33596.25  43654.0
Sale        40039.50  45645.0
Software     7751.50  10002.0